package Study;

public class Overriding {
/*
 * 		메소드 오버라이딩(method overriding)
 * 		메소드 오버라이딩은 자식 클래스가 부모 클래스의 메소드를 자신의 필요에 맞추어서 재정의하는 것이다.
 * 		이때 메소드의 이름이나 매개 변수, 반환형은 동일하여야 한다.
 * 		기능의 확장을 위해서 사용.
 * 
 * 		키워드 super는 부모클래스의 메소드를 호출
 * 
 * 		오버로딩(overloading)
 * 		같은 클래스 내에서 같은 이름의 메소드를 여러개 정의 하는것으로 매개변수의
 * 		타입이 다르거나 개수가 다름.
 * 		return 타입과 접근 제한자는 영향 없음.
 * 
 * 		다형성
 * 		하나의 클래스나 함수가 다양한 방식으로 동작 가능 한 것.
 * 		오버라이딩과 오버로딩을 통해서 다형성 구현 가능.
 * 		객체들의 타입이 다르면 똑같은 메시지가 전달 되더라도 서로 다른 동작을 하는 것.
 * 
 * 		업캐스팅
 * 		부모 클래스 변수로 자식 클래스 객체를 참조할 수 있다.
 * 		이것을 업캐스팅(상형 형변환)이라한다.
 * 		업캐스팅은 묵시적으로 수행될 수 있다.
 * 		업캐스팅을 사용하면 부모 클래스의 멤버에 접근할 수 있다. 하지만 자식 클래스의 멤버는 접근이 불가능하다.
 * 
 * 		다운캐스팅
 * 		부모 객체를 자식 객체로 형변환
 * 		
 */
	
}
